const meta = {
  organization_type: [
    'การท่องเที่ยวและการโรงแรม',
    'การธนาคาร บริการทางการเงิน',
    'การผลิตและอุตสาหกรรม',
    'การศึกษา',
    'ดูแลสุขภาพ',
    'ที่ปรึกษา',
    'บริการด้านกฎหมายและวิชาชีพ',
    'ประกันภัยและประกันชีวิต',
    'ปิโตรเคมีและเคมีภัณฑ์',
    'พลังงานและสาธารณูปโภค',
    'สินค้าอุปโภคบริโภค',
    'สื่อและสิ่งพิมพ์',
    'หน่วยงาน หรือองค์กรของรัฐบาล',
    'องค์กรไม่แสวงหาผลกำไร',
    'อุปกรณ์และเครื่องใช้ทางการแพทย์',
    'เทคโนโลยีสารสนเทศและการสื่อสาร',
    'เภสัชกรรมและเทคโนโลยีชีวภาพ',
    'โรงพยาบาล',
    'อื่น ๆ',
  ],
  organization_employee_size: [
    'พนักงาน 1 - 9 คน',
    'พนักงาน 10 - 19 คน',
    'พนักงาน 20 - 49 คน',
    'พนักงาน 50 - 249 คน',
    'พนักงาน 250 คนขึ้นไป',
  ],
};

export const signup = {
  meta,
};
