export function ComplianceDetail() {
  return (
    <ul>
      <li>
        หน่วยงานยังไม่มีการจัดทำแผนที่สอดคล้องกับแผนพัฒนารัฐบาลดิจิทัล
      </li>
      <li>
        หน่วยงานยังไม่มีแผนและรายชื่อ
        ชุดข้อมูลที่คาดว่าจะทำธรรมาภิบาลข้อมูลภาครัฐหรือมีราย
        ชื่อชุดข้อมูลที่คาดว่าจะทำธรรมาภิบาลข้อมูล
        แล้วแต่ยังไม่มีแผน การดำเนินงาน
      </li>
      <li>หน่วยงานไม่มีการเปิดเผยข้อมูลในระดับใดเลย</li>
      <li>
        หน่วยงานไม่มีการเปิดเผยชุดข้อมูลเปิดภาครัฐในรูปแบบดิจิทัลต่อสาธารณะ
      </li>
      <li>หน่วยงานไม่มีการนำข้อมูลไป วิเคราะห์</li>
    </ul>
  );
}
