export const section03 = [
  {
    key: 'e089cbc1-178e-432b-bb2c-bcfdfd7a058a',
    widget: 'question-group',
    title:
      '3. การจัดการความเสี่ยงในระบบเทคโนโลยีสารสนเทศ',
    alias: '3p',
    children: [
      {
        key: '7e6d1ffd-3e0a-457c-8b26-61f7b9fc29be',
        widget: 'radio-box',
        alias: '1c',
        title:
          '3.1 โรงพยาบาลของท่าน มีแผนจัดการความเสี่ยงเป็นลายลักษณ์อักษร โดยกำหนดกลยุทธ์โครงการ ระยะเวลาดำเนินการ\n' +
          'ผู้รับผิดชอบ อย่างชัดเจน',
        verticalAlignment: true,
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
          {
            value: 2,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มีแผนจัดการความเสี่ยง',
          },
          {
            title:
              'มีแผนจัดการความเสี่ยง และแผนการกำหนดกลยุทธ์การจัดการความเสี่ยง',
          },
        ],
      },
      {
        key: 'c6d09cb8-3d48-46a6-82b6-8f231cc4373c',
        widget: 'radio-box',
        alias: '2c',
        verticalAlignment: true,
        title:
          '3.2 โรงพยาบาลของท่าน มีกระบวนการประเมิน และให้คะแนนความเสี่ยงของระบบสารสนเทศอย่างเป็นระบบ \n' +
          'โดยการมีส่วนร่วมของทุกฝ่าย หรือไม่',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
          {
            value: 2,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มีกระบวนการประเมิน',
          },
          {
            title:
              'มีการกระบวนการประเมินโดยมีส่วนร่วม และมีการให้คะแนนความเสี่ยงของระบบ',
          },
        ],
      },
      {
        key: 'e8ab1a3b-2528-478f-b7bd-32219035099a',
        widget: 'radio-box',
        alias: '3c',
        verticalAlignment: true,
        title:
          '3.3 โรงพยาบาลของท่าน มีการดำเนินการตามแผนจัดการความเสี่ยง หรือไม่',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี',
          },
        ],
      },
      {
        key: '3de36c33-895e-4db3-bce3-8bf1ed4e472e',
        widget: 'radio-box',
        alias: '4c',
        verticalAlignment: true,
        title:
          '3.4 โรงพยาบาลของท่าน มีการติดตาม ประเมินผลการดำเนินการจัดการความเสี่ยง และวิเคราะห์ผลการประเมิน \n' +
          'จัดทำเป็นรายงาน',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
          {
            value: 1,
          },
          {
            value: 2,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title:
              'มี การติดตามการดำเนินการจัดการความเสี่ยง',
          },
          {
            title:
              'มี การติดตาม และประเมินผลการดำเนินการจัดการความเสี่ยง',
          },
          {
            title:
              'มี การติดตาม ประเมินและวิเคราะห์ผล การดำเนินการจัดการความเสี่ยง (แนบหลักฐาน)',
            isMore: true,
            type: 'attachment',
            placeholder: 'แนบหลักฐาน',
          },
        ],
      },
      {
        key: 'b3c7033a-2401-4e01-bc3f-8c8033f38128',
        widget: 'radio-box',
        alias: '5c',
        verticalAlignment: true,
        title:
          '3.5 โรงพยาบาลของท่าน มีการตรวจสอบจากผู้ตรวจสอบภายในของหน่วยงาน (Internal Auditor) หรือผู้ตรวจสอบ\n' +
          'อิสระด้านความมั่นคงปลอดภัยจากภายนอก (External Auditor) อย่างน้อยปีละหนึ่งครั้ง เพื่อให้หน่วยงานได้ทราบถึง\n' +
          'ระดับความเสี่ยงและระดับความมั่นคงปลอดภัยสารสนเทศ หรือไม่',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี (แนบหลักฐาน)',
            isMore: true,
            type: 'attachment',
            placeholder: 'แนบหลักฐาน',
          },
        ],
      },
      {
        key: 'd27ab234-7be2-4924-be7b-956299f57ba7',
        widget: 'radio-box',
        alias: '6c',
        verticalAlignment: true,
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        title:
          '3.6 โรงพยาบาลของท่าน มีการนำผลการประเมินการดำเนินการจัดการความเสี่ยงมาปรับแผนการจัดการความเสี่ยงให้ดีขึ้น',
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี',
          },
        ],
      },
      {
        key: 'fab3d5bb-f400-4cf8-aa58-82969e463845',
        widget: 'radio-box',
        alias: '7c',
        verticalAlignment: true,
        title:
          '3.7 โรงพยาบาลของท่าน มีการจัดทำนโยบายและระเบียบปฏิบัติด้านความมั่นคงปลอดภัยในระบบเทคโนโลยี\n' +
          'สารสนเทศหรือไม่',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
          {
            value: 2,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title:
              'มี การจัดทำนโยบาย หรือระเบียบปฏิบัติด้านความมั่นคงปลอดภัยในระบบเทคโนโลยีสารสนเทศ',
          },
          {
            title:
              'มี การจัดทำนโยบาย และระเบียบปฏิบัติด้านความมั่นคงปลอดภัยในระบบเทคโนโลยีสารสนเทศ',
          },
        ],
      },
      {
        key: '2411e1df-8c9d-4d02-a2dc-665dbeb4b02b',
        widget: 'radio-box',
        alias: '8c',
        verticalAlignment: true,
        title:
          '3.8 โรงพยาบาลของท่าน มีระเบียบปฏิบัติที่อนุญาตให้เฉพาะผู้ที่รับผิดชอบดูแลรักษาผู้ป่วยในช่วงเวลาปัจจุบัน เท่านั้นที่จะ เข้าถึงข้อมูลผู้ป่วยรายนั้นได้',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี',
          },
        ],
      },
      {
        key: '1902decb-f544-4411-8298-0669c6a58091',
        widget: 'radio-box',
        alias: '9c',
        verticalAlignment: true,
        title:
          '3.9 โรงพยาบาลของท่าน มีระเบียบปฏิบัติที่ป้องกันความลับผู้ป่วยมิให้รั่วไหลทุกช่องทาง รวมทั้งช่องทาง Social Media ทุกด้าน (ตัวอย่าง เช่น การกำหนดรหัส มีอักขระพิเศษ/ Removable device)',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี',
          },
        ],
      },
      {
        key: '44ac18e7-5e81-4458-9486-91d671d90342',
        widget: 'radio-box',
        alias: '10c',
        verticalAlignment: true,
        title:
          '3.10 โรงพยาบาลของท่าน มีการประชาสัมพันธ์นโยบายและระเบียบปฏิบัติให้บุคลากรทุกคนได้รับทราบ',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี',
          },
        ],
      },
      {
        key: 'f9fb94a3-061b-41e7-80ae-2d911dafd0bb',
        widget: 'radio-box',
        alias: '11c',
        title:
          '3.11 โรงพยาบาลของท่าน มีการตรวจสอบว่าบุคลากรได้รับทราบ เข้าใจ ยอมรับ และปฏิบัติตามระเบียบปฏิบัติด้าน\n' +
          'ความมั่นคงปลอดภัยอย่างเคร่งครัด',
        verticalAlignment: true,
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title: 'มี',
          },
        ],
      },
      {
        key: 'ceee20c3-a4dc-4d14-9f9d-b7d1cd2c18a3',
        widget: 'radio-box',
        alias: '12c',
        verticalAlignment: true,
        title:
          '3.12 โรงพยาบาลของท่าน มีการประเมินผลการปฏิบัติตามระเบียบปฏิบัติและนำผลการประเมินมาปรับกระบวน\n' +
          'การบังคับใช้ระเบียบปฏิบัติต่อไป',
        scores: [
          {
            value: 0,
          },
          {
            value: 1,
          },
          {
            value: 2,
          },
        ],
        options: [
          {
            title: 'ไม่มี',
          },
          {
            title:
              'มีการประเมินผลการปฏิบัติตามระเบียบปฏิบัติ',
          },
          {
            title:
              'มีการประเมินผลการปฏิบัติตามระเบียบปฏิบัติ และนำผลการประเมินมาปรับใช้ในโรงพยาบาล',
          },
        ],
      },
    ],
  },
];
