export const section00 = [
  {
    key: 'dbe78069-9ea5-4c08-ab54-c6b732c77f58',
    alias: '1s',
    widget: 'statement',
    title:
      'แบบสํารวจระดับความพร้อมระบบเทคโนโลยีสารสนเทศโรงพยาบาลรัฐ ประจําปี 2566',
    description: `
คำอธิบายเกี่ยวกับแบบสอบถาม มีจำนวนทั้งหมด 7 ข้อ

วัตถุประสงค์ของการสำรวจความพร้อมของระบบเทคโนโลยีสารสนเทศ สามารถระบุได้ดังนี้
1. เพื่อประเมินระดับความพร้อมของระบบเทคโนโลยีสารสนเทศในการให้บริการแก่ผู้ใช้งานว่ามีประสิทธิภาพและประสิทธิผลในการใช้งาน
2. เพื่อได้ข้อมูลเพื่อการวางแผนและการพัฒนาระบบเทคโนโลยีสารสนเทศในอนาคตเพื่อปรับปรุงและพัฒนาระบบให้เหมาะสมกับความต้องการของผู้ใช้งาน
3. เพื่อได้ข้อมูลนำไปปรับปรุงกระบวนการให้บริการด้านเทคโนโลยีสารสนเทศให้มีประสิทธิภาพและสามารถตอบสนองความต้องการของผู้ใช้งานได้อย่างเหมาะสม
4. เพื่อประเมินความพร้อมระบบรักษาความปลอดภัยของข้อมูลส่วนบุคคลและการรักษาความลับของข้อมูลในระบบลเทคโนโลยีสารสนเทศในโรงพยาบาลรัฐ

แบบสำรวจประกอบด้วยคำถาม 2 ประเภท คือ
1) คำถามปลายปิด คือ คำถามแบบให้เลือกตอบในตัวเลือกที่กำหนดไว้แล้ว โดยทำการติ๊กเลือกในช่อง [ ] หมายถึง ตอบได้มากกว่า 1 คำตอบ 
หรือ ( ) หมายถึง ตอบได้คำตอบเดียว
2) คำถามปลายเปิด คือ คำถามที่เว้นช่องว่างสำหรับกรอกข้อความเพื่อกรอกรายละเอียดของคำตอบ
    `,
  },
];
